//////////////////////////////////////////////////////////////////////
// 무엇을 하는(어떤 작업을 실행하는) 프로그램 일까요?
// 어떤 프로그램 언어로 작성된 코드 일까요?
// 색깔은 총 몇 종류인가요? 왜 다를까요?
// 특수 기호들의 종류는 몇 개 되나요? 어떤 의미로 왜 사용되었을까요? 
// 사용된 변수의 갯수 총 몇 개일까요?
// 선언문, 조건문, 반복문은 코드의 어느 부분에서 사용되었을까요?
//////////////////////////////////////////////////////////////////////


#include <stdio.h>

int main () 
{
    int age;
    int over_age = 0;
    int under_age = 0;

    for (int i = 0; i < 3; i++) {
        printf("당신의 나이는 : ");
        scanf("%d", &age);

        if (age > 19) {
            printf("당신은 성년입니다. \n\n");
            over_age = over_age + 1;
        }
        else {
            printf("당신은 미성년자입니다. \n\n");
            under_age = under_age + 1;
        }
    }

    printf("성년 : %d 명\n", over_age);
    printf("미성년 : %d 명", under_age) ;

    return 0;
}
